<!DOCTYPE html>
<html>

<head>
	<title>Funny New World</title>
	<meta charset="utf-8" />
</head>
<body>

<?php 

function getPostParam($name){
    if(isset($_POST[$name])){
        return htmlentities($_POST[$name]);  //如果提交的值中有html标签，这个可以转义，防止原文输出时，html被解析
    }else{
        return "";
    }
}
$intro = "结果...";

?>

<form action="./regex-helper.php?hasField=true" method="post">
<fieldset>
    <legend>正则助手preg_match_all</legend>

    <br />
正则表达式：
<input type="text" name="regix" value="<?php echo getPostParam('regix'); ?>"/>
<br />
字符串：
<input type="text" name="src" value="<?php echo getPostParam('src'); ?>"/>
<br />
结果：<br />
<textarea name="intro" rows="20" cols="80">
<?php 
if(isset($_GET["hasField"])){
    ///提交了表单
    echo "正则：" . getPostParam("regix") . "\n\n";
    echo "字符串：" . getPostParam("src") . "\n\n";
    $pattern = getPostParam("regix");
    $src = getPostParam("src");

    $m = array();
    $res = preg_match_all($pattern, $src, $m);
    if($res === 0){
        $intro = "无匹配";
        echo $intro;
    }else{
        $intro = "匹配${res}次\n\n";
        echo $intro;
        print_r($m);
    }
}else{
    ///没提交表单
}
?>
</textarea>

<br /><br />
<input type="submit" value="开始匹配" />

</fieldset>
</form>
<pre>
<?php
$sss = <<<'EOT'

一、校验数字的表达式
 1 数字：^[0-9]*$
 2 n位的数字：^\d{n}$
 3 至少n位的数字：^\d{n,}$
 4 m-n位的数字：^\d{m,n}$
 5 零和非零开头的数字：^(0|[1-9][0-9]*)$
 6 非零开头的最多带两位小数的数字：^([1-9][0-9]*)+(.[0-9]{1,2})?$
 7 带1-2位小数的正数或负数：^(\-)?\d+(\.\d{1,2})?$
 8 正数、负数、和小数：^(\-|\+)?\d+(\.\d+)?$
 9 有两位小数的正实数：^[0-9]+(.[0-9]{2})?$
10 有1~3位小数的正实数：^[0-9]+(.[0-9]{1,3})?$
11 非零的正整数：^[1-9]\d*$ 或 ^([1-9][0-9]*){1,3}$ 或 ^\+?[1-9][0-9]*$
12 非零的负整数：^\-[1-9][]0-9"*$ 或 ^-[1-9]\d*$
13 非负整数：^\d+$ 或 ^[1-9]\d*|0$
14 非正整数：^-[1-9]\d*|0$ 或 ^((-\d+)|(0+))$
15 非负浮点数：^\d+(\.\d+)?$ 或 ^[1-9]\d*\.\d*|0\.\d*[1-9]\d*|0?\.0+|0$
16 非正浮点数：^((-\d+(\.\d+)?)|(0+(\.0+)?))$ 或 ^(-([1-9]\d*\.\d*|0\.\d*[1-9]\d*))|0?\.0+|0$
17 正浮点数：^[1-9]\d*\.\d*|0\.\d*[1-9]\d*$ 或 ^(([0-9]+\.[0-9]*[1-9][0-9]*)|([0-9]*[1-9][0-9]*\.[0-9]+)|([0-9]*[1-9][0-9]*))$
18 负浮点数：^-([1-9]\d*\.\d*|0\.\d*[1-9]\d*)$ 或 ^(-(([0-9]+\.[0-9]*[1-9][0-9]*)|([0-9]*[1-9][0-9]*\.[0-9]+)|([0-9]*[1-9][0-9]*)))$
19 浮点数：^(-?\d+)(\.\d+)?$ 或 ^-?([1-9]\d*\.\d*|0\.\d*[1-9]\d*|0?\.0+|0)$
二、校验字符的表达式
 1 汉字：^[\u4e00-\u9fa5]{0,}$
 2 英文和数字：^[A-Za-z0-9]+$ 或 ^[A-Za-z0-9]{4,40}$
 3 长度为3-20的所有字符：^.{3,20}$
 4 由26个英文字母组成的字符串：^[A-Za-z]+$
 5 由26个大写英文字母组成的字符串：^[A-Z]+$
 6 由26个小写英文字母组成的字符串：^[a-z]+$
 7 由数字和26个英文字母组成的字符串：^[A-Za-z0-9]+$
 8 由数字、26个英文字母或者下划线组成的字符串：^\w+$ 或 ^\w{3,20}$
 9 中文、英文、数字包括下划线：^[\u4E00-\u9FA5A-Za-z0-9_]+$
10 中文、英文、数字但不包括下划线等符号：^[\u4E00-\u9FA5A-Za-z0-9]+$ 或 ^[\u4E00-\u9FA5A-Za-z0-9]{2,20}$
11 可以输入含有^%&',;=?$\"等字符：[^%&',;=?$\x22]+
12 禁止输入含有~的字符：[^~\x22]+
三、特殊需求表达式
 1 Email地址：^\w+([-+.]\w+)*@\w+([-.]\w+)*\.\w+([-.]\w+)*$
 2 域名：[a-zA-Z0-9][-a-zA-Z0-9]{0,62}(/.[a-zA-Z0-9][-a-zA-Z0-9]{0,62})+/.?
 3 InternetURL：[a-zA-z]+://[^\s]* 或 ^http://([\w-]+\.)+[\w-]+(/[\w-./?%&=]*)?$
 4 手机号码：^(13[0-9]|14[5|7]|15[0|1|2|3|5|6|7|8|9]|18[0|1|2|3|5|6|7|8|9])\d{8}$
 5 电话号码("XXX-XXXXXXX"、"XXXX-XXXXXXXX"、"XXX-XXXXXXX"、"XXX-XXXXXXXX"、"XXXXXXX"和"XXXXXXXX)：^(\(\d{3,4}-)|\d{3.4}-)?\d{7,8}$ 
 6 国内电话号码(0511-4405222、021-87888822)：\d{3}-\d{8}|\d{4}-\d{7}
 7 身份证号(15位、18位数字)：^\d{15}|\d{18}$
 8 短身份证号码(数字、字母x结尾)：^([0-9]){7,18}(x|X)?$ 或 ^\d{8,18}|[0-9x]{8,18}|[0-9X]{8,18}?$
 9 帐号是否合法(字母开头，允许5-16字节，允许字母数字下划线)：^[a-zA-Z][a-zA-Z0-9_]{4,15}$
10 密码(以字母开头，长度在6~18之间，只能包含字母、数字和下划线)：^[a-zA-Z]\w{5,17}$
11 强密码(必须包含大小写字母和数字的组合，不能使用特殊字符，长度在8-10之间)：^(?=.*\d)(?=.*[a-z])(?=.*[A-Z]).{8,10}$  
12 日期格式：^\d{4}-\d{1,2}-\d{1,2}
13 一年的12个月(01～09和1～12)：^(0?[1-9]|1[0-2])$
14 一个月的31天(01～09和1～31)：^((0?[1-9])|((1|2)[0-9])|30|31)$ 
15 钱的输入格式：
16    1.有四种钱的表示形式我们可以接受:"10000.00" 和 "10,000.00", 和没有 "分" 的 "10000" 和 "10,000"：^[1-9][0-9]*$ 
17    2.这表示任意一个不以0开头的数字,但是,这也意味着一个字符"0"不通过,所以我们采用下面的形式：^(0|[1-9][0-9]*)$ 
18    3.一个0或者一个不以0开头的数字.我们还可以允许开头有一个负号：^(0|-?[1-9][0-9]*)$ 
19    4.这表示一个0或者一个可能为负的开头不为0的数字.让用户以0开头好了.把负号的也去掉,因为钱总不能是负的吧.下面我们要加的是说明可能的小数部分：^[0-9]+(.[0-9]+)?$ 
20    5.必须说明的是,小数点后面至少应该有1位数,所以"10."是不通过的,但是 "10" 和 "10.2" 是通过的：^[0-9]+(.[0-9]{2})?$ 
21    6.这样我们规定小数点后面必须有两位,如果你认为太苛刻了,可以这样：^[0-9]+(.[0-9]{1,2})?$ 
22    7.这样就允许用户只写一位小数.下面我们该考虑数字中的逗号了,我们可以这样：^[0-9]{1,3}(,[0-9]{3})*(.[0-9]{1,2})?$ 
23    8.1到3个数字,后面跟着任意个 逗号+3个数字,逗号成为可选,而不是必须：^([0-9]+|[0-9]{1,3}(,[0-9]{3})*)(.[0-9]{1,2})?$ 
24    备注：这就是最终结果了,别忘了"+"可以用"*"替代如果你觉得空字符串也可以接受的话(奇怪,为什么?)最后,别忘了在用函数时去掉去掉那个反斜杠,一般的错误都在这里
25 xml文件：^([a-zA-Z]+-?)+[a-zA-Z0-9]+\\.[x|X][m|M][l|L]$
26 中文字符的正则表达式：[\u4e00-\u9fa5]
27 双字节字符：[^\x00-\xff]    (包括汉字在内，可以用来计算字符串的长度(一个双字节字符长度计2，ASCII字符计1))
28 空白行的正则表达式：\n\s*\r    (可以用来删除空白行)
29 HTML标记的正则表达式：<(\S*?)[^>]*>.*?</\1>|<.*? />    (网上流传的版本太糟糕，上面这个也仅仅能部分，对于复杂的嵌套标记依旧无能为力)
30 首尾空白字符的正则表达式：^\s*|\s*$或(^\s*)|(\s*$)    (可以用来删除行首行尾的空白字符(包括空格、制表符、换页符等等)，非常有用的表达式)
31 腾讯QQ号：[1-9][0-9]{4,}    (腾讯QQ号从10000开始)
32 中国邮政编码：[1-9]\d{5}(?!\d)    (中国邮政编码为6位数字)
33 IP地址：\d+\.\d+\.\d+\.\d+    (提取IP地址时有用)

    
2.    "^\d+$"　　//非负整数（正整数 + 0） 
3.    "^[0-9]*[1-9][0-9]*$"　　//正整数 
4.    "^((-\d+)|(0+))$"　　//非正整数（负整数 + 0） 
5.    "^-[0-9]*[1-9][0-9]*$"　　//负整数 
6.    "^-?\d+$"　　　　//整数 
7.    "^\d+(\.\d+)?$"　　//非负浮点数（正浮点数 + 0） 
8.    "^(([0-9]+\.[0-9]*[1-9][0-9]*)|([0-9]*[1-9][0-9]*\.[0-9]+)|([0-9]*[1-9][0-9]*))$"　　//正浮点数 
9.    "^((-\d+(\.\d+)?)|(0+(\.0+)?))$"　　//非正浮点数（负浮点数 + 0） 
10.    "^(-(([0-9]+\.[0-9]*[1-9][0-9]*)|([0-9]*[1-9][0-9]*\.[0-9]+)|([0-9]*[1-9][0-9]*)))$"　　//负浮点数 
11.    "^(-?\d+)(\.\d+)?$"　　//浮点数 
12.    "^[A-Za-z]+$"　　//由26个英文字母组成的字符串 
13.    "^[A-Z]+$"　　//由26个英文字母的大写组成的字符串 
14.    "^[a-z]+$"　　//由26个英文字母的小写组成的字符串 
15.    "^[A-Za-z0-9]+$"　　//由数字和26个英文字母组成的字符串 
16.    "^\w+$"　　//由数字、26个英文字母或者下划线组成的字符串 
17.    "^[\w-]+(\.[\w-]+)*@[\w-]+(\.[\w-]+)+$"　　　　//email地址 
18.    "^[a-zA-z]+://(\w+(-\w+)*)(\.(\w+(-\w+)*))*(\?\S*)?$"　　//url 
19.    /^(d{2}|d{4})-((0([1-9]{1}))|(1[1|2]))-(([0-2]([1-9]{1}))|(3[0|1]))$/   //  年-月-日 
20.    /^((0([1-9]{1}))|(1[1|2]))/(([0-2]([1-9]{1}))|(3[0|1]))/(d{2}|d{4})$/   // 月/日/年 
21.    "^([w-.]+)@(([[0-9]{1,3}.[0-9]{1,3}.[0-9]{1,3}.)|(([w-]+.)+))([a-zA-Z]{2,4}|[0-9]{1,3})(]?)$"   //Emil 
22.    /^((\+?[0-9]{2,4}\-[0-9]{3,4}\-)|([0-9]{3,4}\-))?([0-9]{7,8})(\-[0-9]+)?$/     //电话号码 
23.    "^(d{1,2}|1dd|2[0-4]d|25[0-5]).(d{1,2}|1dd|2[0-4]d|25[0-5]).(d{1,2}|1dd|2[0-4]d|25[0-5]).(d{1,2}|1dd|2[0-4]d|25[0-5])$"   //IP地址 
24.    
25.    匹配中文字符的正则表达式： [\u4e00-\u9fa5] 
26.    匹配双字节字符(包括汉字在内)：[^\x00-\xff] 
27.    匹配空行的正则表达式：\n[\s| ]*\r 
28.    匹配HTML标记的正则表达式：/<(.*)>.*<\/\1>|<(.*) \/>/ 
29.    匹配首尾空格的正则表达式：(^\s*)|(\s*$) 
30.    匹配Email地址的正则表达式：\w+([-+.]\w+)*@\w+([-.]\w+)*\.\w+([-.]\w+)* 
31.    匹配网址URL的正则表达式：^[a-zA-z]+://(\\w+(-\\w+)*)(\\.(\\w+(-\\w+)*))*(\\?\\S*)?$ 
32.    匹配帐号是否合法(字母开头，允许5-16字节，允许字母数字下划线)：^[a-zA-Z][a-zA-Z0-9_]{4,15}$ 
33.    匹配国内电话号码：(\d{3}-|\d{4}-)?(\d{8}|\d{7})? 
34.    匹配腾讯QQ号：^[1-9]*[1-9][0-9]*$ 
120.    匹配双字节字符(包括汉字在内)：[^x00-xff] 
121.    
122.    匹配空行的正则表达式：n[s| ]*r 
123.    
124.    匹配HTML标记的正则表达式：/<(.*)>.*</1>|<(.*) />/ 
125.    
126.    匹配首尾空格的正则表达式：(^s*)|(s*$) 
127.    
128.    匹配Email地址的正则表达式：w+([-+.]w+)*@w+([-.]w+)*.w+([-.]w+)* 
129.    
130.    匹配网址URL的正则表达式：http://([w-]+.)+[w-]+(/[w- ./?%&=]*)? 
131.    
132.    利用正则表达式限制网页表单里的文本框输入内容： 
133.    
134.    用正则表达式限制只能输入中文：onkeyup="value=value.replace(/[^u4E00-u9FA5]/g,'')" onbeforepaste="clipboardData.setData('text',clipboardData.getData('text').replace(/[^u4E00-u9FA5]/g,''))" 
135.    
136.    用正则表达式限制只能输入全角字符： onkeyup="value=value.replace(/[^uFF00-uFFFF]/g,'')" onbeforepaste="clipboardData.setData('text',clipboardData.getData('text').replace(/[^uFF00-uFFFF]/g,''))" 
137.    
138.    用正则表达式限制只能输入数字：onkeyup="value=value.replace(/[^d]/g,'') "onbeforepaste="clipboardData.setData('text',clipboardData.getData('text').replace(/[^d]/g,''))" 
139.    
140.    用正则表达式限制只能输入数字和英文：onkeyup="value=value.replace(/[W]/g,'') "onbeforepaste="clipboardData.setData('text',clipboardData.getData('text').replace(/[^d]/g,''))" 
141.    
142.    =========常用正则式 
143.    
144.    
145.    
146.    匹配中文字符的正则表达式： [\u4e00-\u9fa5] 
147.    
148.    匹配双字节字符(包括汉字在内)：[^\x00-\xff] 
149.    
150.    匹配空行的正则表达式：\n[\s| ]*\r 
151.    
152.    匹配HTML标记的正则表达式：/<(.*)>.*<\/\1>|<(.*) \/>/ 
153.    
154.    匹配首尾空格的正则表达式：(^\s*)|(\s*$) 
155.    
156.    匹配IP地址的正则表达式：/(\d+)\.(\d+)\.(\d+)\.(\d+)/g // 
157.    
158.    匹配Email地址的正则表达式：\w+([-+.]\w+)*@\w+([-.]\w+)*\.\w+([-.]\w+)* 
159.    
160.    匹配网址URL的正则表达式：http://(/[\w-]+\.)+[\w-]+(/[\w- ./?%&=]*)? 
161.    
162.    sql语句：^(select|drop|delete|create|update|insert).*$ 
163.    
164.    1、非负整数：^\d+$ 
165.    
166.    2、正整数：^[0-9]*[1-9][0-9]*$ 
167.    
168.    3、非正整数：^((-\d+)|(0+))$ 
169.    
170.    4、负整数：^-[0-9]*[1-9][0-9]*$ 
171.    
172.    5、整数：^-?\d+$ 
173.    
174.    6、非负浮点数：^\d+(\.\d+)?$ 
175.    
176.    7、正浮点数：^((0-9)+\.[0-9]*[1-9][0-9]*)|([0-9]*[1-9][0-9]*\.[0-9]+)|([0-9]*[1-9][0-9]*))$ 
177.    
178.    8、非正浮点数：^((-\d+\.\d+)?)|(0+(\.0+)?))$ 
179.    
180.    9、负浮点数：^(-((正浮点数正则式)))$ 
181.    
182.    10、英文字符串：^[A-Za-z]+$ 
183.    
184.    11、英文大写串：^[A-Z]+$ 
185.    
186.    12、英文小写串：^[a-z]+$ 
187.    
188.    13、英文字符数字串：^[A-Za-z0-9]+$ 
189.    
190.    14、英数字加下划线串：^\w+$ 
191.    
192.    15、E-mail地址：^[\w-]+(\.[\w-]+)*@[\w-]+(\.[\w-]+)+$ 
193.    
194.    16、URL：^[a-zA-Z]+://(\w+(-\w+)*)(\.(\w+(-\w+)*))*(\?\s*)?$ 
195.    或：^http:\/\/[A-Za-z0-9]+\.[A-Za-z0-9]+[\/=\?%\-&_~`@[\]\':+!]*([^<>\"\"])*$ 
196.    
197.    17、邮政编码：^[1-9]\d{5}$ 
198.    
199.    18、中文：^[\u0391-\uFFE5]+$ 
200.    
201.    19、电话号码：^((\(\d{2,3}\))|(\d{3}\-))?(\(0\d{2,3}\)|0\d{2,3}-)?[1-9]\d{6,7}(\-\d{1,4})?$ 
202.    
203.    20、手机号码：^((\(\d{2,3}\))|(\d{3}\-))?13\d{9}$ 
204.    
205.    21、双字节字符(包括汉字在内)：^\x00-\xff 
206.    
207.    22、匹配首尾空格：(^\s*)|(\s*$)（像vbscript那样的trim函数） 
208.    
209.    23、匹配HTML标记：<(.*)>.*<\/\1>|<(.*) \/> 
210.    
211.    24、匹配空行：\n[\s| ]*\r 
212.    
213.    25、提取信息中的网络链接：(h|H)(r|R)(e|E)(f|F) *= *('|")?(\w|\\|\/|\.)+('|"| *|>)? 
214.    
215.    26、提取信息中的邮件地址：\w+([-+.]\w+)*@\w+([-.]\w+)*\.\w+([-.]\w+)* 
216.    
217.    27、提取信息中的图片链接：(s|S)(r|R)(c|C) *= *('|")?(\w|\\|\/|\.)+('|"| *|>)? 
218.    
219.    28、提取信息中的IP地址：(\d+)\.(\d+)\.(\d+)\.(\d+) 
220.    
221.    29、提取信息中的中国手机号码：(86)*0*13\d{9} 
222.    
223.    30、提取信息中的中国固定电话号码：(\(\d{3,4}\)|\d{3,4}-|\s)?\d{8} 
224.    
225.    31、提取信息中的中国电话号码（包括移动和固定电话）：(\(\d{3,4}\)|\d{3,4}-|\s)?\d{7,14} 
226.    
227.    32、提取信息中的中国邮政编码：[1-9]{1}(\d+){5} 
228.    
229.    33、提取信息中的浮点数（即小数）：(-?\d*)\.?\d+ 
230.    
231.    34、提取信息中的任何数字 ：(-?\d*)(\.\d+)? 
232.    
233.    35、IP：(\d+)\.(\d+)\.(\d+)\.(\d+) 
234.    
235.    36、电话区号：/^0\d{2,3}$/ 
236.    
237.    37、腾讯QQ号：^[1-9]*[1-9][0-9]*$ 
238.    
239.    38、帐号(字母开头，允许5-16字节，允许字母数字下划线)：^[a-zA-Z][a-zA-Z0-9_]{4,15}$ 
240.    
241.    39、中文、英文、数字及下划线：^[\u4e00-\u9fa5_a-zA-Z0-9]+$
EOT;
echo $sss; 
?>
</pre>

</body>